app/views/ideas/index.html.erb

	<% end %>
	<a href="/bright_ideas/<%=idea.id%>"><%=idea.users_liked.count %> people</a> like this<br>
---
SELECT "likes".* FROM "likes"
SELECT COUNT(*) FROM "likes"
SELECT COUNT(*) FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1  [["idea_id", 1]]