app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "idea_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["idea_id", 1], ["created_at", 2016-11-18 15:48:06 UTC], ["updated_at", 2016-11-18 15:48:06 UTC]]
---
	def create
		@like=Like.new(idea_id: params[:id], user_id: current_user.id)
		@like.save